import '../models/chapter_model.dart';
import '../models/course_model.dart';
import '../models/quiz_model.dart';

List<Chapter> getChaptersForLevelAndYear(String level, String year) {
  // Replace this with actual logic to fetch chapters based on level and year
  return [
    Chapter(
      number: "الوحدة التعليمية الأولى",
      title: 'حضارات ما قبل التاريخ',
      heartsRequired: 0,
      // Initial state (unlocked)
      courses: [
        Course(
          number: "الأولى",
          title: 'دراسة الآثار القديمة',
          starsRequired: 3,
          heartsGranted: 1,
          starsGranted: 5,
          content: '''
                # دراسة الآثار القديمة
                ---
                ## **خطوات دراستها**
                ---
                ### 1. **المقدمة**
                ---
                - **طبيعة الأثر:** تمثال أثري يعود إلى العصر الروماني.
                - **مصدره:** اكتشافه ضمن حفريات أثرية بمنطقة تيبازة، الجزائر.
                - **صاحبه:** يعتقد أنه يمثل شخصية أسطورية أو قائدًا بارزًا في المجتمع الروماني.
                - **الإطار الزماني والمكاني:** يعود إلى القرن الثاني الميلادي، تيبازة كموقع أثري روماني على الساحل الجزائري.
                ---
                ### 2. **التحليل**
                ---
                #### **الفكرة العامة:**
                فهم دلالات التمثال الثقافية والاجتماعية وأهميته التاريخية ضمن الحضارة الرومانية.
                ---
                #### **الأفكار الجزئية:**
                ---
                - **التقنية والأسلوب:** التمثال منحوت بدقة تعكس تطور الفن الروماني، مصنوع من الرخام.
                - **الأبعاد الرمزية:** يمثل شخصية أسطورية مرتبطة بالديانة الرومانية في تلك الفترة.
                - **السياق التاريخي:** وجود التمثال في تيبازة يشير إلى أهمية المدينة كجزء من المستعمرات الرومانية
                ---
                ### 3. **الاستنتاج**
                ---
                - **استنتاجات رئيسية:** يعكس التمثال تطور الفن الروماني وتأثير الثقافة الرومانية على شمال إفريقيا.
                - **الأهمية التاريخية:** يعتبر التمثال دليلًا ماديًا على العلاقات الثقافية والسياسية بين الإمبراطورية الرومانية والمناطق التي احتلتها.
                - **التوصيات:** ضرورة حفظ التمثال ودراسته بشكل أعمق للكشف عن مزيد من المعلومات حول الحياة الاجتماعية والدينية في تلك الحقبة.
                ''',
          quiz: Quiz(
            title: 'اختبار: دراسة الآثار القديمة',
            questions: [
              Question(
                questionText: 'ما المادة الرئيسية للتمثال؟',
                choices: ['رخام', 'جرانيت', 'حجر جيري', 'خشب'],
                correctAnswer: 'رخام',
              ),
              Question(
                questionText: 'في أي مدينة تم اكتشاف التمثال؟',
                choices: ['تيبازة', 'تيمقاد', 'جميلة', 'قالمة'],
                correctAnswer: 'تيبازة',
              ),
              Question(
                questionText: 'ما هو الدور الرمزي للتمثال؟',
                choices: [
                  'تمثيل ديني',
                  'تمثيل اجتماعي',
                  'تمثيل تجاري',
                  'تمثيل سياسي'
                ],
                correctAnswer: 'تمثيل ديني',
              ),
              Question(
                questionText: 'ما العصر الذي ينتمي إليه التمثال؟',
                choices: ['الروماني', 'العثماني', 'البيزنطي', 'الإسلامي'],
                correctAnswer: 'الروماني',
              ),
            ],
          ),
        ),
        Course(
          number: "الثانية",
          title: 'الآثار عنوان الفترة التي عاشها الإنسان',
          starsRequired: 5,
          heartsGranted: 1,
          starsGranted: 4,
          content: '''
                # الآثار عنوان الفترة التي عاشها الإنسان
                
                ## **المقدمة**
                - **الآثار:** هي البقايا المادية للحضارات القديمة التي تعكس تطور الإنسان وحياته الاجتماعية والاقتصادية والثقافية.
                - **الأهمية:** تعتبر الآثار مصدرًا هامًا لدراسة التاريخ والحضارات القديمة وتوثيق تطور الإنسان على مر العصور.
                
                ---
                
                ## **العصور التاريخية**
                ### 1. **العصور القديمة**
                - **العصر الحجري:** عصر بدأ في العصر الحجري القديم وانتهى بانتقال الإنسان إلى الزراعة والرعي.
                - **العصر النحاسي:** عصر انتقال الإنسان إلى استخدام النحاس في صناعة الأدوات والسلاح.
                - **العصر البرونزي:** عصر استخدام البرونز في صناعة الأدوات والأسلحة.
                - **العصر الحديدي:** عصر استخدام الحديد في صناعة الأدوات والأسلحة.

                ### 2. **العصور الوسطى**
                - **العصر القديم:** عصر انتقال الإنسان من الحياة البرية إلى الحياة الحضرية.
                - **العصر الوسيط:** عصر انتقال الإنسان من الحضارة القديمة إلى الحضارة الحديثة.
                ''',
          quiz: Quiz(
            title: 'اختبار: الآثار عنوان الفترة التي عاشها الإنسان',
            questions: [
              Question(
                questionText: 'ما هي أهمية الآثار؟',
                choices: [
                  'توثيق التاريخ',
                  'تزيين المدن',
                  'ترويج السياحة',
                  'التجارة'
                ],
                correctAnswer: 'توثيق التاريخ',
              ),
              Question(
                questionText: 'ما هو العصر الذي استخدم فيه البرونز لأول مرة؟',
                choices: ['الحجري', 'البرونزي', 'النحاسي', 'الحديدي'],
                correctAnswer: 'البرونزي',
              ),
              Question(
                questionText: 'ما هي المادة التي استخدمت في العصر الحجري؟',
                choices: ['الحجر', 'النحاس', 'الحديد', 'الرصاص'],
                correctAnswer: 'الحجر',
              ),
              Question(
                questionText: 'أي عصر تميز باستخدام الحديد؟',
                choices: ['الحديدي', 'الحجري', 'النحاسي', 'البرونزي'],
                correctAnswer: 'الحديدي',
              ),
            ],
          ),
        ),
        Course(
          number: "الثالثة",
          title: 'كرونولوجيا عصور ما قبل التاريخ',
          starsRequired: 7,
          heartsGranted: 1,
          starsGranted: 3,
          content: '''
                # كرونولوجيا عصور ما قبل التاريخ

                ## **المقدمة**
                - **التاريخ:** هو دراسة الماضي وتوثيق الأحداث والتطورات التي شهدها الإنسان على مر العصور.
                - **التاريخ القديم:** يعتبر العصور القديمة من أهم فترات التاريخ التي شهدت تطورًا كبيرًا في الحضارة الإنسانية.
                - **التاريخ الحديث:** يعتبر العصور الحديثة من أهم فترات التاريخ التي شهدت تقدمًا كبيرًا في العلوم والتكنولوجيا.

                ---

                ## **العصور القديمة**
                ### 1. **العصر الحجري**
                - **العصر القديم:** عصر بدأ في العصر الحجري القديم وانتهى بانتقال الإنسان إلى الزراعة والرعي.
                - **العصر النحاسي:** عصر انتقال الإنسان إلى استخدام النحاس في صناعة الأدوات والسلاح.
                - **العصر البرونزي:** عصر استخدام البرونز في صناعة الأدوات والأسلحة.
                - **العصر الحديدي:** عصر استخدام الحديد في صناعة الأدوات والأسلحة.

                ### 2. **العصور الوسطى**
                - **العصر القديم:** عصر انتقال الإنسان من الحياة البرية إلى الحياة الحضرية.
                ''',
          quiz: Quiz(
            title: 'اختبار: كرونولوجيا عصور ما قبل التاريخ',
            questions: [
              Question(
                questionText: 'ما المادة الأساسية المستخدمة في العصر الحجري؟',
                choices: ['الحجر', 'البرونز', 'النحاس', 'الحديد'],
                correctAnswer: 'الحجر',
              ),
              Question(
                questionText: 'أي عصر شهد استخدام البرونز؟',
                choices: ['البرونزي', 'الحجري', 'النحاسي', 'الحديدي'],
                correctAnswer: 'البرونزي',
              ),
            ],
          ),
        ),
      ],
      backgroundImage: 'assets/images/chapter1.png',
    ),
    Chapter(
      number: "الوحدة التعليمية الثانية",
      title: 'التاريخ الوطني',
      heartsRequired: 3, 

      courses: [
        Course(
          number: "الأولى",
          title: 'العصر الإسلامي',
          starsRequired: 5,
          heartsGranted: 1,
          starsGranted: 2,
          content: '''
                # العصر الإسلامي
                ---
                ## **الفترة الزمنية**
                - بدأ مع الدعوة الإسلامية.
                - تطور في ظل الفتوحات.
                ---
                ## **الأثر**
                - بناء المدن الإسلامية.
                - تطور العلوم والفنون.
                ''',
          quiz: Quiz(
            title: 'اختبار: العصر الإسلامي',
            questions: [
              Question(
                questionText: 'ما هو العصر الذي يعتبر بداية العصر الإسلامي؟',
                choices: [
                  'القرن الأول هجري',
                  'القرن الثاني هجري',
                  'القرن الثالث هجري',
                  'القرن الرابع هجري'
                ],
                correctAnswer: 'القرن الأول هجري',
              ),
              Question(
                questionText: 'ما هي المظاهر العمرانية في العصر الإسلامي؟',
                choices: ['المدن', 'القرى', 'المزارع', 'الصحراء'],
                correctAnswer: 'المدن',
              ),
            ],
          ),
        ),
        Course(
          number: "الثانية",
          title: 'الحضارة الإسلامية',
          starsRequired: 7,
          starsGranted: 3,
          heartsGranted: 2,
          content: '''
                # الحضارة الإسلامية
                ---
                ## **العلوم والفنون**
                - تطور الطب والهندسة.
                - ازدهار العمارة والزخرفة.
                ---
                ## **التأثير العالمي**
                - انتشار الثقافة الإسلامية.
                - تأثيرها على النهضة الأوروبية.
                ''',
          quiz: Quiz(
            title: 'اختبار: الحضارة الإسلامية',
            questions: [
              Question(
                questionText: 'ما هو العلم الذي اشتهر فيه العلماء المسلمون؟',
                choices: ['الطب', 'الهندسة', 'الفلك', 'جميع ما سبق'],
                correctAnswer: 'جميع ما سبق',
              ),
              Question(
                questionText: 'ما هو تأثير الحضارة الإسلامية على أوروبا؟',
                choices: ['النهضة', 'الاستعمار', 'التجارة', 'التعليم'],
                correctAnswer: 'النهضة',
              ),
            ],
          ),
        ),
      ],
      backgroundImage: 'assets/images/chapter2.jpg',
    ),
  ];
}

List<Course> getCoursesFromChapter(String chapterTitle) {
  // Iterate over all chapters to find the chapter with the matching title
  for (var chapter in getChaptersForLevelAndYear("some_level", "some_year")) {
    if (chapter.title == chapterTitle) {
      // Check if the chapter is unlocked based on available hearts
      return chapter.courses;
    }
  }
  // If the chapter is not found or is locked, return an empty list
  return [];
}
